Revit 2024 API
BuiltInFailures.SweepFailures.WallSweepInconsistent Property
 The model contains corrupt elements. Delete the corrupt elements to proceed or cancel the action without deleting the elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WallSweepInconsistent { get; }
Visual Basic
Public Shared ReadOnly Property WallSweepInconsistent As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WallSweepInconsistent {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SweepFailures Class
Autodesk.Revit.DB Namespace